function [Y] = InitY()
%   对线路参数形成形成节点导纳矩阵

% N = input('请输入节点数： N = ');
% L = input('请输入支路数： L = ');
% fprintf('请按以下格式输入: 低压侧节点编号(变压器填负号)， 高压侧节点编号（变压器填负号），线路电阻, 线路电感, 接地导纳或变比\n');
% Info = input('请输入支路信息：\n');
% %每行是一条支路
% % 第一列是支路的一个端点I编号，对于架空线路来说是任一端，变压器所在端用负号表示，电分书p65页Ypp
% % 第二列是支路的一个端点J编号，对于架空线路来说是另一端，变压器所在端用负号表示
% % 第三列是支路的电阻R
% % 第四列是支路的电抗X
% % 第五列是支路的对地电纳或变比，k在j侧为正

N = 3;
L = 3;
Info = [1, 2, 0, 0.1, 0.01;
        1, 3, 0, 0.1, 0.01;
        2, 3, 0, 0.1, 0.01;];

G = zeros(N);
B = zeros(N);

for i = 1 : L                                           %L条节点信息
    I = Info(i, 1); 
    J = Info(i, 2);
    R = Info(i, 3);
    X = Info(i, 4);
    k = Info(i, 5);

    if I * J > 0
        B(I, I) = B(I, I) + k;
        B(J, J) = B(J, J) + k;
        k = 1;
    else
        if I < 0
            t = I;
            I = J;
            J = -t;
        else
            J = -J;
        end
        
        if k < 0
            k = -1 / k;
        end
    end

    G(I, J) = - (1 / k) * R / (R^2 + X^2);              %互导要加负号
    B(I, J) = (1 / k) * X / (R^2 + X^2);                %负负得正
    G(J, I) = G(I, J);
    B(J, I) = B(I, J);
    G(I, I) = G(I, I) + R / (R^2 + X^2);                %低压侧，电分书p65，Ypp
    G(J, J) = G(J, J) + (1 / k^2) * R / (R^2 + X^2);    %高压侧
    B(I, I) = B(I, I) - X / (R^2 + X^2);
    B(J, J) = B(J, J) - (1 / k^2) * X / (R^2 + X^2);

end

Y = G + 1j .* B;

end